---
kind: property
id: P:Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfections
source: html/48fb092c-a982-fc30-b6ed-839a462ca029.htm
---
# Autodesk.Revit.DB.Visual.Hardwood.HardwoodImperfections Property

The property labeled "Relief Pattern" from the "Hardwood" schema.

## Syntax (C#)
```csharp
public static string HardwoodImperfections { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodImperfectionsType".